import classNames from 'classnames';

import style from './offer.module.scss';

export const Offer = (props) => (
  <section className={style.offer}>
    <h2 className={classNames(style.offer__title, style['title--xxl'])}>{props.title}</h2>
    <div className={style['offer-list__wrap']}>
      <ol className={style.offer__list}>
        <li className={style.offer__item}>
          <span className={style['item-offer__title']}>
            Идейные соображения высшего порядка, а также высокое качество позиционных исследований представляет собой
            интересный эксперимент проверки экспериментов, поражающих по своей масштабности и грандиозности.
          </span>
          <ol className={style['item-offer__list']}>
            <li className={style['item-offer__item']}>
              Задача организации, в особенности же социально-экономическое развитие однозначно определяет каждого
              участника как способного принимать собственные решения касаемо инновационных методов управления
              процессами.
            </li>
            <li className={style['item-offer__item']}>
              Не следует, однако, забывать, что разбавленное изрядной долей эмпатии, рациональное мышление играет важную
              роль в формировании приоритизации разума над эмоциями. Но некоторые особенности внутренней политики лишь
              добавляют фракционных разногласий и преданы социально-демократической анафеме.
            </li>
            <li className={style['item-offer__item']}>
              Приятно, граждане, наблюдать, как элементы политического процесса, превозмогая сложившуюся непростую
              экономическую ситуацию, объявлены нарушающими общечеловеческие нормы этики и морали.
            </li>
            <li className={style['item-offer__item']}>
              Но независимые государства, которые представляют собой яркий пример континентально-европейского типа
              политической культуры, будут объединены в целые кластеры себе подобных.
            </li>
          </ol>
        </li>
        <li className={style.offer__item}>
          <span className={style['item-offer__title']}>
            С учётом сложившейся международной обстановки, консультация с широким активом предоставляет широкие
            возможности для приоритизации разума над эмоциями.
          </span>
          <ol className={style['item-offer__list']}>
            <li className={style['item-offer__item']}>
              Задача организации, в особенности же социально-экономическое развитие однозначно определяет каждого
              участника как способного принимать собственные решения касаемо инновационных методов управления
              процессами.
              <ol className={style['item-offer__list']}>
                <li className={style['item-offer__item']}>
                  Не следует, однако, забывать, что разбавленное изрядной долей эмпатии, рациональное мышление играет
                  важную роль в формировании приоритизации разума над эмоциями. Но некоторые особенности внутренней
                  политики лишь добавляют фракционных разногласий и преданы социально-демократической анафеме.
                </li>
                <li className={style['item-offer__item']}>
                  Приятно, граждане, наблюдать, как элементы политического процесса, превозмогая сложившуюся непростую
                  экономическую ситуацию, объявлены нарушающими общечеловеческие нормы этики и морали.
                </li>
              </ol>
            </li>
            <li className={style['item-offer__item']}>
              Но независимые государства, которые представляют собой яркий пример континентально-европейского типа
              политической культуры, будут объединены в целые кластеры себе подобных.
            </li>
          </ol>
        </li>
        <li className={style.offer__item}>
          <span className={style['item-offer__title']}>
            Повседневная практика показывает, что убеждённость некоторых оппонентов требует от нас анализа распределения
            внутренних резервов и ресурсов.
          </span>
          <ol className={style['item-offer__list']}>
            <li className={style['item-offer__item']}>
              Задача организации, в особенности же социально-экономическое развитие однозначно определяет каждого
              участника как способного принимать собственные решения касаемо инновационных методов управления
              процессами.
              <ol className={style['item-offer__list']}>
                <li className={style['item-offer__item']}>
                  Не следует, однако, забывать, что разбавленное изрядной долей эмпатии, рациональное мышление играет
                  важную роль в формировании приоритизации разума над эмоциями. Но некоторые особенности внутренней
                  политики лишь добавляют фракционных разногласий и преданы социально-демократической анафеме.
                </li>
                <li className={style['item-offer__item']}>
                  Приятно, граждане, наблюдать, как элементы политического процесса, превозмогая сложившуюся непростую
                  экономическую ситуацию, объявлены нарушающими общечеловеческие нормы этики и морали.
                </li>
              </ol>
            </li>
            <li className={style['item-offer__item']}>
              Но независимые государства, которые представляют собой яркий пример континентально-европейского типа
              политической культуры, будут объединены в целые кластеры себе подобных.
            </li>
            <li className={style['item-offer__item']}>
              Не следует, однако, забывать, что экономическая повестка сегодняшнего дня требует анализа анализа
              существующих паттернов поведения.
              <ol className={style['item-offer__list']}>
                <li className={style['item-offer__item']}>
                  А ещё представители современных социальных резервов набирают популярность среди определенных слоев
                  населения, а значит, должны быть функционально разнесены на независимые элементы.
                  <ol className={style['item-offer__list']}>
                    <li className={style['item-offer__item']}>
                      Стремящиеся вытеснить традиционное производство, нанотехнологии могут быть объявлены нарушающими
                      общечеловеческие нормы этики и морали.
                    </li>
                    <li className={style['item-offer__item']}>
                      Прежде всего, разбавленное изрядной долей эмпатии, рациональное мышление однозначно фиксирует
                      необходимость новых предложений. Являясь всего лишь частью общей картины, независимые государства
                      представлены в исключительно положительном свете.
                    </li>
                  </ol>
                </li>
              </ol>
            </li>
            <li className={style['item-offer__item']}>
              Повседневная практика показывает, что убеждённость некоторых оппонентов требует от нас анализа
              распределения внутренних резервов и ресурсов.
            </li>
          </ol>
        </li>
      </ol>
    </div>
  </section>
);
